# Entertainment Data

In [137]:
import pandas as pd
import json
import csv
import time
import sys
import http.client, urllib.request, urllib.parse, urllib.error, base64

## Data Request

In [138]:
astrings2 = list()


try:
    conn = http.client.HTTPSConnection('apina.address.gov.sa')
    for page_num in range(1, 2):
                    conn.request("GET", "https://apina.address.gov.sa/NationalAddress/v3.1/address/poi-fixed-params?language=E&format=JSON&ServiceString=Entertainment&cityname=riyadh&api_key=01fb2a0d9be04a9d95332c3076c49a1e&page=" + str(page_num))
                    response = conn.getresponse()
                    data= response.read()
                    decode=data.decode('utf-8', 'ignore')
                    astrings2.append(decode)
                    time.sleep(5)
                    conn.close()
except Exception as e:
    print("[Errno {0}] {1}".format(e.errno, e.strerror))

####################################

## Data Assesment

In [139]:
print(len(astrings2))

1

In [140]:
df=pd.Series(astrings2).to_frame()

In [141]:
df.head(50)

                                                   0
0  {"totalSearchResults":"6","Addresses":[{"Title...

## Create a Dataframe

In [142]:
x=0 
for index, row in df.iterrows():
    if x==0:
              y=df[0][index]
              result=pd.read_json (y)
    else:
                y=df[0][index]
                result=result.append(pd.read_json (y))
    x=x+1

In [143]:
result.head(50)

,totalSearchResults,Addresses,PostCode,success,result,statusdescription,fullexception
0,6,"{'Title': 'al hilal entertainment city', 'Addr...",NaN,True,NaN,SUCCESS,NaN
1,6,{'Title': 'fanatir international entertainment...,NaN,True,NaN,SUCCESS,NaN
2,6,"{'Title': 'al rimal entertainment restaurant',...",NaN,True,NaN,SUCCESS,NaN
3,6,{'Title': 'al hokair entertainment and sports ...,NaN,True,NaN,SUCCESS,NaN
4,6,"{'Title': 'home entertainment systems ', 'Addr...",NaN,True,NaN,SUCCESS,NaN
5,6,"{'Title': 'cristal entertainment hall', 'Addre...",NaN,True,NaN,SUCCESS,NaN

In [144]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
totalSearchResults    6 non-null int64
Addresses             6 non-null object
PostCode              0 non-null float64
success               6 non-null bool
result                0 non-null float64
statusdescription     6 non-null object
fullexception         0 non-null float64
dtypes: bool(1), float64(3), int64(1), object(2)
memory usage: 310.0+ bytes

## Data Cleaning

In [145]:
result.drop(["PostCode","success",'result','statusdescription','success','fullexception'], axis = 1, inplace = True)

In [146]:
result.head()

   totalSearchResults                                          Addresses
0                   6  {'Title': 'al hilal entertainment city', 'Addr...
1                   6  {'Title': 'fanatir international entertainment...
2                   6  {'Title': 'al rimal entertainment restaurant',...
3                   6  {'Title': 'al hokair entertainment and sports ...
4                   6  {'Title': 'home entertainment systems ', 'Addr...

In [147]:
result['Addresses'] = result['Addresses'].astype(str)
d=result.Addresses.str.split(',', expand = True)

In [148]:
d.head()

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,{'Title': 'al hilal entertainment city','Address1': '3832 al imam abi hanifah - Middl...,'Address2': 'RIYADH 12954 - 6398','ObjLatLng': '12954002336 46.6201102460002 24...,'BuildingNumber': '3832','Street': 'al imam abi hanifah','District': 'Middle Oraija Dist.','City': 'RIYADH','PostCode': '12954','AdditionalNumber': '6398',...,'DistrictID': '10100003128','Title_L2': ' ','RegionName_L2': ' ','City_L2': '','Street_L2': ' ','District_L2': ' ','CompanyName_L2': None,'GovernorateID': None,'Governorate': None,'Governorate_L2': None}
1,{'Title': 'fanatir international entertainment','Address1': '3948 al malik abdullah ibn abdul...,'Address2': 'RIYADH 12272 - 6583','ObjLatLng': '12272117815 46.6780977829663 24...,'BuildingNumber': '3948','Street': 'al malik abdullah ibn abdulaziz rd','District': 'King Fahd Dist.','City': 'RIYADH','PostCode': '12272','AdditionalNumber': '6583',...,'DistrictID': '10100003017','Title_L2': ' ','RegionName_L2': ' ','City_L2': '','Street_L2': ' ','District_L2': ' ','CompanyName_L2': None,'GovernorateID': None,'Governorate': None,'Governorate_L2': None}
2,{'Title': 'al rimal entertainment restaurant','Address1': '2925 ath thumamah rd - Al Munisi...,'Address2': 'RIYADH 13255 - 8093','ObjLatLng': '13255008298 46.7693166810002 24...,'BuildingNumber': '2925','Street': 'ath thumamah rd','District': 'Al Munisiyah Dist.','City': 'RIYADH','PostCode': '13255','AdditionalNumber': '8093',...,'DistrictID': '10100003140','Title_L2': ' ','RegionName_L2': ' ','City_L2': '','Street_L2': ' ','District_L2': ' ','CompanyName_L2': None,'GovernorateID': None,'Governorate': None,'Governorate_L2': None}
3,{'Title': 'al hokair entertainment and sports ','Address1': '4004 umar ibn abdul aziz branch ...,'Address2': 'RIYADH 12824 - 6483','ObjLatLng': '12824007897 46.7647698612286 24...,'BuildingNumber': '4004','Street': 'umar ibn abdul aziz branch rd','District': 'Al Rabwah Dist.','City': 'RIYADH','PostCode': '12824','AdditionalNumber': '6483',...,'DistrictID': '10100003047','Title_L2': ' ','RegionName_L2': ' ','City_L2': '','Street_L2': ' ','District_L2': ' ','CompanyName_L2': None,'GovernorateID': None,'Governorate': None,'Governorate_L2': None}
4,{'Title': 'home entertainment systems ','Address1': '2960 as sail al kabir - Al Ghade...,'Address2': 'RIYADH 13311 - 7088','ObjLatLng': '13311118816 46.6483540297983 24...,'BuildingNumber': '2960','Street': 'as sail al kabir','District': 'Al Ghadeer Dist.','City': 'RIYADH','PostCode': '13311','AdditionalNumber': '7088',...,'DistrictID': '10100003109','Title_L2': ' ','RegionName_L2': ' ','City_L2': '','Street_L2': ' ','District_L2': ' ','CompanyName_L2': None,'GovernorateID': None,'Governorate': None,'Governorate_L2': None}

In [149]:
d.drop([2,3,19,4,5,7,8,9,10,11,12,13,17,18,16,21,22,23,24,25,26,27,28,29], axis = 1, inplace = True)

In [150]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
0     6 non-null object
1     6 non-null object
6     6 non-null object
14    6 non-null object
15    6 non-null object
20    6 non-null object
dtypes: object(6)
memory usage: 208.0+ bytes

In [151]:
d.head()

,0,1,6,14,15,20
0,{'Title': 'al hilal entertainment city','Address1': '3832 al imam abi hanifah - Middl...,'District': 'Middle Oraija Dist.','Latitude': '24.604682649','Longitude': '46.6201102460002','DistrictID': '10100003128'
1,{'Title': 'fanatir international entertainment','Address1': '3948 al malik abdullah ibn abdul...,'District': 'King Fahd Dist.','Latitude': '24.7342519052837','Longitude': '46.6780977829663','DistrictID': '10100003017'
2,{'Title': 'al rimal entertainment restaurant','Address1': '2925 ath thumamah rd - Al Munisi...,'District': 'Al Munisiyah Dist.','Latitude': '24.8505710070002','Longitude': '46.7693166810002','DistrictID': '10100003140'
3,{'Title': 'al hokair entertainment and sports ','Address1': '4004 umar ibn abdul aziz branch ...,'District': 'Al Rabwah Dist.','Latitude': '24.6925357077015','Longitude': '46.7647698612286','DistrictID': '10100003047'
4,{'Title': 'home entertainment systems ','Address1': '2960 as sail al kabir - Al Ghade...,'District': 'Al Ghadeer Dist.','Latitude': '24.7706639821298','Longitude': '46.6483540297983','DistrictID': '10100003109'

In [152]:
d.columns = ["title","address","district","latitude","longitude","id"]

In [153]:
d.head()

,title,address,district,latitude,longitude,id
0,{'Title': 'al hilal entertainment city','Address1': '3832 al imam abi hanifah - Middl...,'District': 'Middle Oraija Dist.','Latitude': '24.604682649','Longitude': '46.6201102460002','DistrictID': '10100003128'
1,{'Title': 'fanatir international entertainment','Address1': '3948 al malik abdullah ibn abdul...,'District': 'King Fahd Dist.','Latitude': '24.7342519052837','Longitude': '46.6780977829663','DistrictID': '10100003017'
2,{'Title': 'al rimal entertainment restaurant','Address1': '2925 ath thumamah rd - Al Munisi...,'District': 'Al Munisiyah Dist.','Latitude': '24.8505710070002','Longitude': '46.7693166810002','DistrictID': '10100003140'
3,{'Title': 'al hokair entertainment and sports ','Address1': '4004 umar ibn abdul aziz branch ...,'District': 'Al Rabwah Dist.','Latitude': '24.6925357077015','Longitude': '46.7647698612286','DistrictID': '10100003047'
4,{'Title': 'home entertainment systems ','Address1': '2960 as sail al kabir - Al Ghade...,'District': 'Al Ghadeer Dist.','Latitude': '24.7706639821298','Longitude': '46.6483540297983','DistrictID': '10100003109'

In [154]:
d['title']=d.title.str.strip('{\'Title\': \'')

In [155]:
d['address']=d.address.str.strip('\'Address1\': \'')

In [156]:
d['district']=d.district.str.strip('\'District\': \'')

In [157]:
d['latitude']=d.latitude.str.strip('\'Latitude\': \'')

In [158]:
d['district']=d.district.str.strip('Dist.')

In [159]:
d['longitude']=d.longitude.str.strip('\'Longitude\': \'')

In [160]:
d['id']=d.id.str.strip('\'DistrictID\': \'')

In [161]:
d.head()

,title,address,district,latitude,longitude,id
0,al hilal entertainment city,3832 al imam abi hanifah - Middle Oraija Dist.,Middle Oraija,24.604682649,46.6201102460002,10100003128
1,fanatir international entertainmen,3948 al malik abdullah ibn abdulaziz rd - King...,King Fahd,24.7342519052837,46.6780977829663,10100003017
2,al rimal entertainment restauran,2925 ath thumamah rd - Al Munisiyah Dist.,Al Munisiyah,24.8505710070002,46.7693166810002,10100003140
3,al hokair entertainment and sports,4004 umar ibn abdul aziz branch rd - Al Rabwah...,Al Rabwah,24.6925357077015,46.7647698612286,10100003047
4,home entertainment systems,2960 as sail al kabir - Al Ghadeer Dist.,Al Ghadeer,24.7706639821298,46.6483540297983,10100003109

In [ ]:
d.to_csv("entertainment.csv")

## Transalation

In [ ]:
d=pd.read_csv('entertainment.csv')

In [ ]:
import googletrans 
from googletrans import Translator

In [ ]:
translator = Translator()
for index, row in d.iterrows():
    element= d['title'][index]
    d['title'][index]= translator.translate(element,dest='ar').text

## KPI Calculation

In [1]:
c=d.groupby(['id','district']).count()

NameError: name 'd' is not defined

In [163]:
c.head()

                            title  address  latitude  longitude
id          district
10100003017 King Fahd           1        1         1          1
10100003047 Al Rabwah           1        1         1          1
10100003109 Al Ghadeer          1        1         1          1
10100003128 Middle Oraija       2        2         2          2
10100003140 Al Munisiyah        1        1         1          1

In [164]:
c.drop(["address",'latitude','longitude'], axis = 1, inplace = True)

In [165]:
c

                            title
id          district
10100003017 King Fahd           1
10100003047 Al Rabwah           1
10100003109 Al Ghadeer          1
10100003128 Middle Oraija       2
10100003140 Al Munisiyah        1

## Create JSON  Files

In [166]:
c.to_json(R'C:\Users\jwoha\NationalAddressAPI\KPIs\EntertainmentKPIs.json', orient='records', lines=True)

In [167]:
d.to_json(R'C:\Users\jwoha\NationalAddressAPI\POIs\EntertainmentPOIs.json', orient='records', lines=True)